/*Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]
6, 1, 33-> [6, 1, 33]*/
int let = 8;                                                //Длина массива
int[] array = new int[let];
for (int i = 0; i < let; i++)
{
    array[i] = new Random().Next(-10000,10000);             //Рандомизатор
}
Console.WriteLine($"[ {String.Join(", ", array)} ]");       //Вывод значений